### Heroes Of Pymoli Data Analysis
* Of the 1163 active players, the vast majority are male (84%). There also exists, a smaller, but notable proportion of female players (14%).

* Our peak age demographic falls between 20-24 (44.8%) with secondary groups falling between 15-19 (18.60%) and 25-29 (13.4%).  
-----

### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [194]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# Raw data file
file_to_load = "Resources/purchase_data.csv"

# Read purchasing file and store into pandas data frame
data = pd.read_csv(file_to_load)
data.head(2)

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56

## Player Count

* Display the total number of players

In [195]:
total_players = len(data["SN"].unique())
total_players

576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [196]:
unique_items = len(data["Item ID"].unique())
unique_items

183

In [197]:
avg_price = round(data["Price"].mean(),2)
avg_price

3.05

In [198]:
total_rev = data["Price"].sum()
total_rev

2379.77

In [199]:
total_purchases = data["Item ID"].count()
total_purchases

780

In [200]:
summary = pd.DataFrame({
                        "Number of Unique Items":[unique_items],
                        "Average Price":[avg_price],
                        "Number of Purchases":[total_purchases],
                        "Total Revenue":[total_rev]
                       })
summary

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     183           3.05                  780        2379.77

## Gender Demographics

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [201]:
players = pd.DataFrame(data[["SN","Gender"]].drop_duplicates("SN"))
players = pd.DataFrame(players.groupby("Gender")["Gender"].count())
players = players.rename(columns={"Gender":"Players by Gender"})
players

                       Players by Gender
Gender
Female                                81
Male                                 484
Other / Non-Disclosed                 11

In [202]:
players["Percentage of Players"] = players["Players by Gender"] / total_players
players["Percentage of Players"] = players["Percentage of Players"].map("{0:.2f}%".format)
players

                       Players by Gender Percentage of Players
Gender
Female                                81                 0.14%
Male                                 484                 0.84%
Other / Non-Disclosed                 11                 0.02%


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, etc. by gender


* For normalized purchasing, divide total purchase value by purchase count, by gender


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [203]:
by_gender_avg_price = pd.DataFrame(data.groupby("Gender")["Price"].mean())
by_gender_avg_price["Price"] = by_gender_avg_price["Price"].map("${:.2f}".format)
by_gender_avg_price = by_gender_avg_price.rename(columns={"Price":"Avgerage Purchase Price"})

by_gender_avg_price

                      Avgerage Purchase Price
Gender
Female                                  $3.20
Male                                    $3.02
Other / Non-Disclosed                   $3.35

In [204]:
by_gender_item_count = pd.DataFrame(data.groupby("Gender")["Item Name"].count()).rename(columns={"Item Name":"Purchase Count"})
by_gender_item_count

                       Purchase Count
Gender
Female                            113
Male                              652
Other / Non-Disclosed              15

In [205]:
by_gender_total_value = pd.DataFrame(data.groupby("Gender")["Price"].sum())
by_gender_total_value = by_gender_total_value.rename(columns = {"Price":"Total Purchase Value"})
by_gender_total_value["Total Purchase Value"] = by_gender_total_value["Total Purchase Value"].map("${:.2f}".format)
by_gender_total_value

                      Total Purchase Value
Gender
Female                             $361.94
Male                              $1967.64
Other / Non-Disclosed               $50.19

In [206]:
#Normalized Purchasing = Purchase Price / Purchase Count
df = pd.merge(pd.merge(by_gender_item_count, by_gender_avg_price, on="Gender"),by_gender_total_value, on="Gender")
df

,Purchase Count,Avgerage Purchase Price,Total Purchase Value
Gender,,,
Female,113,$3.20,$361.94
Male,652,$3.02,$1967.64
Other / Non-Disclosed,15,$3.35,$50.19

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [207]:
# Establish bins for ages
age_bins = [0, 9.90, 14.90, 19.90, 24.90, 29.90, 34.90, 39.90, 99999]
group_names = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, etc. in the table below


* Calculate Normalized Purchasing


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [208]:
age_table = data[["SN","Age","Price"]]
age_table.head(2)

            SN  Age  Price
0      Lisim78   20   3.53
1  Lisovynya38   40   1.56

In [209]:
bins = [0, 9.9, 14.9, 19.9, 24.9, 29.9, 34.9, 39.9, 99.9]
age_groups = ["<10","10-14","15-19","20-24","25-29","30-34","35-39","40+"]

In [210]:
age_table["Age Group"] = pd.cut(age_table["Age"], bins, labels = age_groups)
age_table.head(2)

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

            SN  Age  Price Age Group
0      Lisim78   20   3.53     20-24
1  Lisovynya38   40   1.56       40+

In [211]:
by_age_avg_price = pd.DataFrame(age_table.groupby("Age Group")["Price"].mean())
by_age_avg_price = by_age_avg_price.rename(columns={"Price":"Average Purchase Price"})
by_age_avg_price["Average Purchase Price"] = by_age_avg_price["Average Purchase Price"].map("${:.2f}".format)
by_age_avg_price.head()

          Average Purchase Price
Age Group
<10                        $3.35
10-14                      $2.96
15-19                      $3.04
20-24                      $3.05
25-29                      $2.90

In [212]:
by_age_purchase_count = pd.DataFrame(age_table.groupby("Age Group")["SN"].count())
by_age_purchase_count = by_age_purchase_count.rename(columns={"SN":"Total Purchases"})
by_age_purchase_count.head()

           Total Purchases
Age Group
<10                     23
10-14                   28
15-19                  136
20-24                  365
25-29                  101

In [213]:
by_age_total_purchase = pd.DataFrame(age_table.groupby("Age Group")["Price"].sum())
by_age_total_purchase = pd.DataFrame(by_age_total_purchase.rename(columns={"Price":"Total Purchase Value"}))
by_age_total_purchase = pd.DataFrame(by_age_total_purchase["Total Purchase Value"].map("${:.2f}".format))
by_age_total_purchase.head()

          Total Purchase Value
Age Group
<10                     $77.13
10-14                   $82.78
15-19                  $412.89
20-24                 $1114.06
25-29                  $293.00

In [214]:
by_age_summary = pd.merge(pd.merge(by_age_purchase_count, by_age_avg_price, on="Age Group"), by_age_total_purchase, on="Age Group")
by_age_summary

           Total Purchases Average Purchase Price Total Purchase Value
Age Group
<10                     23                  $3.35               $77.13
10-14                   28                  $2.96               $82.78
15-19                  136                  $3.04              $412.89
20-24                  365                  $3.05             $1114.06
25-29                  101                  $2.90              $293.00
30-34                   73                  $2.93              $214.00
35-39                   41                  $3.60              $147.67
40+                     13                  $2.94               $38.24

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [215]:
by_spenders_top_5 = pd.DataFrame(data.groupby("SN")["Price"].sum())
by_spenders_top_5 = pd.DataFrame(by_spenders_top_5.sort_values(by="Price", ascending=False).head(5))
by_spenders_top_5 = pd.DataFrame(by_spenders_top_5["Price"].map("${:.2f}".format))
by_spenders_top_5 = pd.DataFrame(by_spenders_top_5.rename(columns = {"Price":"Total Purchase Value"}))
by_spenders_top_5

            Total Purchase Value
SN
Lisosia93                 $18.96
Idastidru52               $15.45
Chamjask73                $13.83
Iral74                    $13.62
Iskadarya95               $13.10

In [216]:
by_spenders_purchase_count = pd.DataFrame(data.groupby("SN")["Item Name"].count())
by_spenders_purchase_count = by_spenders_purchase_count.sort_values(by="Item Name", ascending=False)
by_spenders_purchase_count.head(2)

           Item Name
SN
Lisosia93          5
Iral74             4

In [217]:
by_spenders_avg_price = pd.DataFrame(data.groupby("SN")["Price"].mean())
by_spenders_avg_price = pd.DataFrame(by_spenders_avg_price["Price"].map("${:.2f}".format))
by_spenders_avg_price = pd.DataFrame(by_spenders_avg_price.rename(columns = {"Price":"Average Purchase Price"}))
by_spenders_avg_price.head(2)

             Average Purchase Price
SN
Adairialis76                  $2.28
Adastirin33                   $4.48

In [218]:
by_spenders_summary = pd.merge(pd.merge(by_spenders_purchase_count, by_spenders_avg_price, on="SN"), by_spenders_top_5, on="SN")
by_spenders_summary

             Item Name Average Purchase Price Total Purchase Value
SN
Lisosia93            5                  $3.79               $18.96
Iral74               4                  $3.40               $13.62
Idastidru52          4                  $3.86               $15.45
Chamjask73           3                  $4.61               $13.83
Iskadarya95          3                  $4.37               $13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [230]:
popularity_table = data.groupby(["Item ID", "Item Name"])

In [231]:
popularity_count = popularity_table.count().sort_values(by="Purchase ID", ascending=False).head(5)
popularity_count = pd.DataFrame(popularity_count.rename(columns={"Purchase ID":"Purchase Count"})["Purchase Count"])

In [232]:
popularity_total_price = pd.DataFrame(popularity_table["Price"].sum())
popularity_total_price = pd.DataFrame(popularity_total_price["Price"].map("${:.2f}".format))
popularity_total_price = pd.DataFrame(popularity_total_price.rename(columns={"Price":"Total Purchase Price"}))

In [233]:
popularity_item_price = pd.DataFrame(popularity_table["Price"].unique())
popularity_item_price = pd.DataFrame(popularity_item_price.rename(columns={"Price":"Item Price"}))

In [235]:
popularity_merged = pd.merge(pd.merge(popularity_count, popularity_item_price, on=["Item ID","Item Name"]),
                 popularity_total_price, on=["Item ID","Item Name"])
popularity_merged

,,Purchase Count,Item Price,Total Purchase Price
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,[4.23],$50.76
145,Fiery Glass Crusader,9,[4.58],$41.22
108,"Extraction, Quickblade Of Trembling Hands",9,[3.53],$31.77
82,Nirvana,9,[4.9],$44.10
19,"Pursuit, Cudgel of Necromancy",8,[1.02],$8.16